
// *****************************************************************************************************************************
// AI コントローラー
// -----------------------------------------------------------------------------------------------------------------------------

var tona_AiControl = { __dummy: null

	// *****************************************************************************************************************************
	// AI のコンビネーションを取得
	// -----------------------------------------------------------------------------------------------------------------------------

	, getCombination: function(unit) {
		var combination = null;
		var patternType = unit.getAIPattern().getPatternType();

		if (patternType === PatternType.APPROACH) {
			combination = CombinationManager.getApproachCombination(unit, true);
		}
		else if (patternType === PatternType.WAIT) {
			combination = CombinationManager.getWaitCombination(unit, true);
		}

		return combination;
	}

	// *****************************************************************************************************************************
	// 最優先行動に、レベルを考慮した乱数で優先度をつける
	// -----------------------------------------------------------------------------------------------------------------------------

	, getMaxRandomScoreWithLevel : function(targetUnit) {

		// 優先度最大
		// 乱数で幅を持たせることでターゲットをランダムにする
		// ただしレベルが高い方が少し選ばれやすい

		return 800 + root.getRandomNumber() % 20 + targetUnit.getLv();
	}
};



